; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	satellite5 - satellite
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	satellite6 - satellite
	instrument14 - instrument
	instrument15 - instrument
	instrument16 - instrument
	thermograph5 - mode
	infrared2 - mode
	image1 - mode
	infrared3 - mode
	image4 - mode
	spectrograph0 - mode
	image6 - mode
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Star2 - direction
	Star5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 thermograph5)
	(supports instrument1 image6)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon7)
	(supports instrument3 thermograph5)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 infrared2)
	(supports instrument4 infrared3)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(supports instrument5 infrared2)
	(calibration_target instrument5 GroundStation1)
	(supports instrument6 spectrograph0)
	(supports instrument6 thermograph5)
	(calibration_target instrument6 GroundStation0)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon6)
	(supports instrument7 image1)
	(supports instrument7 infrared2)
	(calibration_target instrument7 GroundStation0)
	(supports instrument8 image4)
	(supports instrument8 infrared2)
	(supports instrument8 spectrograph0)
	(calibration_target instrument8 GroundStation4)
	(supports instrument9 image1)
	(supports instrument9 image4)
	(calibration_target instrument9 GroundStation1)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star9)
	(supports instrument10 spectrograph0)
	(supports instrument10 infrared3)
	(supports instrument10 image1)
	(calibration_target instrument10 GroundStation1)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon6)
	(supports instrument11 image4)
	(supports instrument11 infrared2)
	(calibration_target instrument11 Star2)
	(supports instrument12 spectrograph0)
	(supports instrument12 infrared3)
	(calibration_target instrument12 GroundStation1)
	(supports instrument13 spectrograph0)
	(supports instrument13 infrared3)
	(calibration_target instrument13 GroundStation0)
	(on_board instrument11 satellite5)
	(on_board instrument12 satellite5)
	(on_board instrument13 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star5)
	(supports instrument14 infrared2)
	(supports instrument14 image6)
	(calibration_target instrument14 Star2)
	(supports instrument15 thermograph5)
	(supports instrument15 infrared3)
	(supports instrument15 image4)
	(calibration_target instrument15 GroundStation1)
	(supports instrument16 image1)
	(supports instrument16 image6)
	(supports instrument16 image4)
	(calibration_target instrument16 Star2)
	(on_board instrument14 satellite6)
	(on_board instrument15 satellite6)
	(on_board instrument16 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Phenomenon7)
)
(:goal (and
	(pointing satellite0 GroundStation1)
	(pointing satellite1 GroundStation1)
	(pointing satellite4 Phenomenon6)
	(pointing satellite6 Star5)
	(have_image Star5 image1)
	(have_image Star5 image6)
	(have_image Phenomenon6 infrared3)
	(have_image Phenomenon7 image4)
	(have_image Star8 image1)
	(have_image Star9 spectrograph0)
))

)

; plan
1. (turn_to satellite6 star2 phenomenon7)
   deleted: (pointing satellite6 phenomenon7)
   added: (pointing satellite6 star2)
   goals met: 1 of 10
2. (switch_on instrument16 satellite6)
   deleted: (power_avail satellite6)
   added: (power_on instrument16)
   goals met: 1 of 10
3. (calibrate satellite6 instrument16 star2)
   added: (calibrated instrument16)
   goals met: 1 of 10
4. (turn_to satellite6 star8 star2)
   deleted: (pointing satellite6 star2)
   added: (pointing satellite6 star8)
   goals met: 1 of 10
5. (take_image satellite6 star8 instrument16 image1)
   added: (have_image star8 image1)
   goals met: 2 of 10
6. (turn_to satellite6 phenomenon7 star8)
   deleted: (pointing satellite6 star8)
   added: (pointing satellite6 phenomenon7)
   goals met: 2 of 10
7. (take_image satellite6 phenomenon7 instrument16 image4)
   added: (have_image phenomenon7 image4)
   goals met: 3 of 10
8. (turn_to satellite6 star5 phenomenon7)
   deleted: (pointing satellite6 phenomenon7)
   added: (pointing satellite6 star5)
   goals met: 4 of 10
9. (turn_to satellite0 groundstation0 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 groundstation0)
   goals met: 4 of 10
10. (take_image satellite6 star5 instrument16 image6)
   added: (have_image star5 image6)
   goals met: 5 of 10
11. (take_image satellite6 star5 instrument16 image1)
   added: (have_image star5 image1)
   goals met: 6 of 10
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 6 of 10
13. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 6 of 10
14. (turn_to satellite0 phenomenon6 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon6)
   goals met: 6 of 10
15. (take_image satellite0 phenomenon6 instrument0 infrared3)
   added: (have_image phenomenon6 infrared3)
   goals met: 7 of 10
16. (turn_to satellite0 star9 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star9)
   goals met: 7 of 10
17. (take_image satellite0 star9 instrument0 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 8 of 10
18. (turn_to satellite0 groundstation1 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation1)
   goals met: 9 of 10
19. (turn_to satellite1 groundstation1 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 groundstation1)
   goals met: 10 of 10
